[
  {
    "description": [
      "Create app header with Logo created",
      "Add app sidebar with toggle functionality",
      "Implement page redirection",
      "Create Updates page"
    ],
    "updateTime": "2025-12-05"
  },
  {
    "description": [
      "Modify app header",
      "Modify app sidebar",
      "Modify page redirection",
      "Modify Updates page"
    ],
    "updateTime": "2025-12-06"
  },
  {
    "description": [
      "Refactor UI components into separate component folders for better organization.",
      "Update Active Jobs page to use real data. Now it will be always up to date with the latest jobs."
    ],
    "updateTime": "2025-12-13"
  },
  {
    "description": [
      "Update Active Jobs page to use real data. Now the detail part's info under assembly uses real data."
    ],
    "updateTime": "2025-12-15"
  },
  {
    "description": [
      "Implement filtering functionality for jobs by customer, contact, date range, and priority.",
      "Implement job sorting in JobTable component with comparator functions for numeric and string values.",
      "Add job search functionality with API endpoint (/api/jobs/search) for quick job lookup.",
      "Normalize date formats across jobs, job_history, and assembly_detail tables to YYYY-MM-DD standard.",
      "Implement virtual scrolling for better performance, improving loading speed from 150ms to ~20-30ms."
    ],
    "updateTime": "2025-12-18"
  },
  {
    "description": [
      "Create job detail page with dynamic routing at /active-jobs/[job_number].",
      "Add navigation from active jobs list to individual job detail page."
    ],
    "updateTime": "2025-12-20"
  },
  {
    "description": [
      "Plan customer and contact database refactoring to migrate from hardcoded customerList to dynamic database management.",
      "Refactor SearchArea and SearchBox components for improved UI organization and code clarity.",
      "Add new FieldLabel and ToggleButtonGroup reusable components for better component composition.",
      "Refactor FilterPopover component to use new FieldLabel and ToggleButtonGroup components.",
      "Modify job search functionality to work with updated component structure.",
      "Enhance DocumentationHistory component with improved formatting and logic."
    ],
    "updateTime": "2025-12-25"
  }
]